trying_out/somse.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body>
<SubmitDecision xmlns="http://www.dpr.co.uk/eBanking/">
<credentials>&lt;?xml version="1.0"?&gt;&lt;Credentials&gt;&lt;Username&gt;lenderupdates@theloansengine.co.uk&lt;/Username&gt;&lt;Password&gt;TleDec2016&lt;/Password&gt;&lt;/Credentials&gt;</credentials><xmlRequest>&lt;?xml version="1.0" encoding="utf-8"?&gt;&lt;Request xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" version="1.0" accountCategory="SecondCharge"&gt;&lt;Options&gt;&lt;IncludeCreditReferenceData&gt;false&lt;/IncludeCreditReferenceData&gt;&lt;RegisterCustomerForEBanking&gt;false&lt;/RegisterCustomerForEBanking&gt;&lt;IsValuationOnSecurityToBeInstructed&gt;false&lt;/IsValuationOnSecurityToBeInstructed&gt;&lt;/Options&gt;&lt;SubmissionRoute&gt;&lt;BrokerId&gt;lenderupdates@theloansengine.co.uk&lt;/BrokerId&gt;&lt;PackagerName&gt;The Loans Engine&lt;/PackagerName&gt;&lt;/SubmissionRoute&gt;&lt;LoanDetails&gt;&lt;AmountToBorrow&gt;40000&lt;/AmountToBorrow&gt;&lt;TermMonths&gt;120&lt;/TermMonths&gt;&lt;LoanType&gt;Residential&lt;/LoanType&gt;&lt;PurchasePrice&gt;329000&lt;/PurchasePrice&gt;&lt;RepaymentType&gt;Repayment&lt;/RepaymentType&gt;&lt;ExistingFirstChargeMortgage&gt;148559&lt;/ExistingFirstChargeMortgage&gt;&lt;IncomeStatus&gt;FullStatus&lt;/IncomeStatus&gt;&lt;LoanPurposes&gt;&lt;LoanPurpose&gt;&lt;Purpose&gt;DebtConsolidation&lt;/Purpose&gt;&lt;Amount&gt;28500&lt;/Amount&gt;&lt;/LoanPurpose&gt;&lt;LoanPurpose&gt;&lt;Purpose&gt;HomeImprovements&lt;/Purpose&gt;&lt;Amount&gt;11500&lt;/Amount&gt;&lt;/LoanPurpose&gt;&lt;/LoanPurposes&gt;&lt;/LoanDetails&gt;&lt;BtlVerification /&gt;&lt;Applicants&gt;&lt;Applicant&gt;&lt;Title&gt;Mr&lt;/Title&gt;&lt;FirstName&gt;Nagarajah&lt;/FirstName&gt;&lt;MiddleName /&gt;&lt;LastName&gt;Niszanthan&lt;/LastName&gt;&lt;DateOfBirth&gt;1975-12-15T00:00:00&lt;/DateOfBirth&gt;&lt;Gender&gt;M&lt;/Gender&gt;&lt;MaritalStatus&gt;Married&lt;/MaritalStatus&gt;&lt;HomeTelephone&gt;07414513828&lt;/HomeTelephone&gt;&lt;WorkTelephone /&gt;&lt;MobilePhone&gt;07414513828&lt;/MobilePhone&gt;&lt;Email&gt;niszan@hotmail.co.uk&lt;/Email&gt;&lt;Nationality&gt;GB&lt;/Nationality&gt;&lt;RetirementAge&gt;72&lt;/RetirementAge&gt;&lt;PermanentResidenceRights&gt;true&lt;/PermanentResidenceRights&gt;&lt;YearsInUK&gt;16&lt;/YearsInUK&gt;&lt;MonthsInUK&gt;2&lt;/MonthsInUK&gt;&lt;Dependents&gt;&lt;Dependent&gt;&lt;Age&gt;10&lt;/Age&gt;&lt;/Dependent&gt;&lt;Dependent&gt;&lt;Age&gt;3&lt;/Age&gt;&lt;/Dependent&gt;&lt;/Dependents&gt;&lt;AddressHistory&gt;&lt;Address&gt;&lt;AddressLine1&gt;Maple Close&lt;/AddressLine1&gt;&lt;Country&gt;England&lt;/Country&gt;&lt;County&gt;Middlesex&lt;/County&gt;&lt;District /&gt;&lt;FlatNumber /&gt;&lt;HouseName /&gt;&lt;HouseNumber&gt;102&lt;/HouseNumber&gt;&lt;Postcode&gt;UB4 9NH&lt;/Postcode&gt;&lt;Town&gt;Hayes&lt;/Town&gt;&lt;ResidentialStatus&gt;OwnerWithMortgage&lt;/ResidentialStatus&gt;&lt;DateFrom&gt;2003-09-13T00:00:00+01:00&lt;/DateFrom&gt;&lt;DateTo&gt;2019-11-13T00:00:00+00:00&lt;/DateTo&gt;&lt;/Address&gt;&lt;/AddressHistory&gt;&lt;Commitments&gt;&lt;CurrentMortgageCommitment&gt;&lt;IsCurrent&gt;true&lt;/IsCurrent&gt;&lt;IsSecured&gt;true&lt;/IsSecured&gt;&lt;Source&gt;UserDeclared&lt;/Source&gt;&lt;IsDSSAssisted&gt;false&lt;/IsDSSAssisted&gt;&lt;IsSecondCharge&gt;true&lt;/IsSecondCharge&gt;&lt;MonthlyPayment&gt;788&lt;/MonthlyPayment&gt;&lt;CurrentBalance&gt;148559&lt;/CurrentBalance&gt;&lt;AccountNumber&gt; &lt;/AccountNumber&gt;&lt;IntendedUse&gt;Repayment&lt;/IntendedUse&gt;&lt;/CurrentMortgageCommitment&gt;&lt;/Commitments&gt;&lt;EmploymentHistory&gt;&lt;EmployedPermanent&gt;&lt;IsPrimaryJob&gt;true&lt;/IsPrimaryJob&gt;&lt;IsCurrent&gt;true&lt;/IsCurrent&gt;&lt;StartDate&gt;2013-11-13T00:00:00+00:00&lt;/StartDate&gt;&lt;EndDate&gt;2019-11-14T00:00:00+00:00&lt;/EndDate&gt;&lt;EmploymentStatus&gt;FullTime&lt;/EmploymentStatus&gt;&lt;Occupation&gt;Export Consultant&lt;/Occupation&gt;&lt;CompanyName&gt;Starleaf Ltd&lt;/CompanyName&gt;&lt;BasicSalary&gt;35000&lt;/BasicSalary&gt;&lt;ShiftAllowance&gt;0&lt;/ShiftAllowance&gt;&lt;Overtime&gt;0&lt;/Overtime&gt;&lt;GuaranteedOBC&gt;0&lt;/GuaranteedOBC&gt;&lt;RegularOBC&gt;0&lt;/RegularOBC&gt;&lt;BonusCommission&gt;0&lt;/BonusCommission&gt;&lt;IsContinuousEmployment&gt;true&lt;/IsContinuousEmployment&gt;&lt;OnProbation&gt;false&lt;/OnProbation&gt;&lt;/EmployedPermanent&gt;&lt;EmployedPermanent&gt;&lt;IsPrimaryJob&gt;false&lt;/IsPrimaryJob&gt;&lt;IsCurrent&gt;true&lt;/IsCurrent&gt;&lt;StartDate&gt;2012-11-13T00:00:00+00:00&lt;/StartDate&gt;&lt;EndDate&gt;2019-11-14T00:00:00+00:00&lt;/EndDate&gt;&lt;EmploymentStatus&gt;FullTime&lt;/EmploymentStatus&gt;&lt;Occupation&gt;Export Consultant &lt;/Occupation&gt;&lt;CompanyName&gt;Julius Rutherford &amp; Co&lt;/CompanyName&gt;&lt;BasicSalary&gt;11856&lt;/BasicSalary&gt;&lt;ShiftAllowance&gt;0&lt;/ShiftAllowance&gt;&lt;Overtime&gt;0&lt;/Overtime&gt;&lt;GuaranteedOBC&gt;0&lt;/GuaranteedOBC&gt;&lt;RegularOBC&gt;0&lt;/RegularOBC&gt;&lt;BonusCommission&gt;0&lt;/BonusCommission&gt;&lt;IsContinuousEmployment&gt;true&lt;/IsContinuousEmployment&gt;&lt;OnProbation&gt;false&lt;/OnProbation&gt;&lt;/EmployedPermanent&gt;&lt;/EmploymentHistory&gt;&lt;/Applicant&gt;&lt;/Applicants&gt;&lt;Security&gt;&lt;IsPrimary&gt;true&lt;/IsPrimary&gt;&lt;SecurityCategory&gt;ResidentialProperty&lt;/SecurityCategory&gt;&lt;SecurityType&gt;House&lt;/SecurityType&gt;&lt;SecuritySubType&gt;EndTerrace&lt;/SecuritySubType&gt;&lt;PurchasePrice&gt;329000&lt;/PurchasePrice&gt;&lt;OriginalDatePurchase&gt;2003-09-19T00:00:00&lt;/OriginalDatePurchase&gt;&lt;IsStandardConstruction&gt;true&lt;/IsStandardConstruction&gt;&lt;NumberOfBedrooms&gt;2&lt;/NumberOfBedrooms&gt;&lt;NumberOfKitches&gt;0&lt;/NumberOfKitches&gt;&lt;NumberOfReceptionRooms&gt;1&lt;/NumberOfReceptionRooms&gt;&lt;NumberOfBathrooms&gt;0&lt;/NumberOfBathrooms&gt;&lt;NumberOfGarages&gt;1&lt;/NumberOfGarages&gt;&lt;NumberOfParkingSpaces&gt;0&lt;/NumberOfParkingSpaces&gt;&lt;Jurisdiction&gt;England&lt;/Jurisdiction&gt;&lt;Tenure&gt;Freehold&lt;/Tenure&gt;&lt;RemainingLeaseYears&gt;0&lt;/RemainingLeaseYears&gt;&lt;IsConnectedToCommercialPremises&gt;false&lt;/IsConnectedToCommercialPremises&gt;&lt;UsedForBusinessPurpose&gt;false&lt;/UsedForBusinessPurpose&gt;&lt;IsConstructedByLocalAuthority&gt;false&lt;/IsConstructedByLocalAuthority&gt;&lt;PurchaseFromLocalAuthority&gt;false&lt;/PurchaseFromLocalAuthority&gt;&lt;HaveAgriculturalRestrictions&gt;false&lt;/HaveAgriculturalRestrictions&gt;&lt;IsListedBuilding&gt;false&lt;/IsListedBuilding&gt;&lt;SecurityAddress&gt;&lt;AddressLine1&gt;Maple Close&lt;/AddressLine1&gt;&lt;Country&gt;England&lt;/Country&gt;&lt;County&gt;Middlesex&lt;/County&gt;&lt;District /&gt;&lt;FlatNumber /&gt;&lt;HouseName /&gt;&lt;HouseNumber&gt;102&lt;/HouseNumber&gt;&lt;Postcode&gt;UB4 9NH&lt;/Postcode&gt;&lt;Town&gt;Hayes&lt;/Town&gt;&lt;/SecurityAddress&gt;&lt;/Security&gt;&lt;Fees&gt;&lt;Fee&gt;&lt;FeeName&gt;Broker Fee&lt;/FeeName&gt;&lt;FeeType&gt;BrokerFee&lt;/FeeType&gt;&lt;Amount&gt;2995&lt;/Amount&gt;&lt;WhenPayable&gt;AddedToLoan&lt;/WhenPayable&gt;&lt;IsAddedToLoan&gt;false&lt;/IsAddedToLoan&gt;&lt;/Fee&gt;&lt;/Fees&gt;&lt;Declarations&gt;&lt;IsHomeownerWithActiveMortgage&gt;true&lt;/IsHomeownerWithActiveMortgage&gt;&lt;IsOwnProperty&gt;true&lt;/IsOwnProperty&gt;&lt;IsUKResident&gt;true&lt;/IsUKResident&gt;&lt;IsUKSecurity&gt;true&lt;/IsUKSecurity&gt;&lt;Is18AndOver&gt;true&lt;/Is18AndOver&gt;&lt;IsBankrupt&gt;false&lt;/IsBankrupt&gt;&lt;AcceptedTC&gt;true&lt;/AcceptedTC&gt;&lt;/Declarations&gt;&lt;/Request&gt;</xmlRequest></SubmitDecision></soap:Body></soap:Envelope>